#==============================================================================
# ** Game_Variables
#------------------------------------------------------------------------------
#  Esta classe gerencia as variáveis.
# A instância desta classe é referenciada por $game_variables.
#==============================================================================

class Game_Variables
  #--------------------------------------------------------------------------
  # * Inicialização do objeto
  #--------------------------------------------------------------------------
  def initialize
    @data = []
  end
  #--------------------------------------------------------------------------
  # * Aquisição da variável
  #     variable_id : id da variável
  #--------------------------------------------------------------------------
  def [](variable_id)
    @data[variable_id] || 0
  end
  #--------------------------------------------------------------------------
  # * Configuração da variável
  #     variable_id : id da variável
  #     value       : valor da variável
  #--------------------------------------------------------------------------
  def []=(variable_id, value)
    @data[variable_id] = value
    on_change
  end
  #--------------------------------------------------------------------------
  # * Quando houver alteração
  #--------------------------------------------------------------------------
  def on_change
    $game_map.need_refresh = true
  end
end
